/*
SQLyog Community v13.1.6 (64 bit)
MySQL - 5.7.15 : Database - java_iccard_db
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`java_iccard_db` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;

USE `java_iccard_db`;

/*Table structure for table `ic_card_easy_msg` */

DROP TABLE IF EXISTS `ic_card_easy_msg`;

CREATE TABLE `ic_card_easy_msg` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '表id（卡id）',
  `blance` varchar(225) DEFAULT NULL COMMENT '卡余额',
  `create_date` varchar(225) DEFAULT NULL COMMENT '创建日期',
  `card_status` varchar(225) DEFAULT '1' COMMENT '卡状态',
  `card_type_type` varchar(225) DEFAULT NULL COMMENT '卡类型',
  `status` int(11) DEFAULT '1' COMMENT '状态字',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_card_easy_msg` */

insert  into `ic_card_easy_msg`(`id`,`blance`,`create_date`,`card_status`,`card_type_type`,`status`) values 
(1,'0.00','2021-11-13 12:22:56','-3','普通卡',0),
(2,'0.00','2021-12-02 21:16:43','-3','普通卡',0),
(3,'0.00','2021-12-04 16:30:29','-3','普通卡',0),
(4,'283.45','2021-12-04 17:06:07','1','普通卡',1),
(5,'10569.06','2021-12-05 10:06:26','1','普通卡',1);

/*Table structure for table `ic_card_handel` */

DROP TABLE IF EXISTS `ic_card_handel`;

CREATE TABLE `ic_card_handel` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `card_id` bigint(20) DEFAULT NULL COMMENT '卡id',
  `handle_type` varchar(225) DEFAULT NULL COMMENT '处理类型',
  `handle_date` varchar(225) DEFAULT NULL COMMENT '处理日期',
  `handle_result` varchar(10) DEFAULT NULL COMMENT '处理结果(-1:已撤销,0:挂失)',
  `mark` varchar(225) DEFAULT NULL COMMENT '处理备注',
  `status` int(11) DEFAULT '1' COMMENT '状态码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_card_handel` */

insert  into `ic_card_handel`(`id`,`card_id`,`handle_type`,`handle_date`,`handle_result`,`mark`,`status`) values 
(14,1,'创建','2021-11-13 12:22:56','创建成功','无',1),
(16,1,'挂失','2021-11-28 15:52:43','0','太那个了啊',1),
(17,1,'挂失撤回','2021-11-28 16:02:00','撤回成功','撤回',1),
(18,1,'挂失','2021-11-28 16:28:37','0','就像挂失',1),
(19,1,'挂失撤回','2021-11-28 16:33:07','撤回成功','挂失撤回---肖家海---2021年33月28日 16时11分03秒',1),
(20,1,'挂失','2021-11-28 16:36:00','0','O(∩_∩)O哈哈~',1),
(21,1,'挂失撤回','2021-11-28 16:36:17','撤回成功','挂失撤回---肖家海---2021年36月28日 16时11分17秒',1),
(22,1,'挂失','2021-11-28 16:39:04','0','百年',1),
(23,1,'挂失撤回','2021-11-28 16:47:05','撤回成功','挂失撤回---肖家海---2021年47月28日 16时11分05秒',1),
(24,1,'挂失','2021-11-29 13:58:39','挂失','1',1),
(25,1,'挂失撤回','2021-11-29 14:03:32','撤回成功','挂失撤回---肖家海---2021年03月29日 14时11分32秒',1),
(26,1,'挂失','2021-11-29 14:03:54','挂失','s',1),
(27,1,'挂失撤回','2021-11-29 14:04:04','撤回成功','挂失撤回---肖家海---2021年04月29日 14时11分04秒',1),
(28,1,'挂失','2021-11-29 14:04:55','挂失','d',1),
(29,1,'挂失撤回','2021-11-29 14:05:10','撤回成功','挂失撤回---肖家海---2021年05月29日 14时11分10秒',1),
(30,1,'挂失','2021-11-29 14:06:03','挂失','test',1),
(31,1,'挂失撤回','2021-11-29 14:08:28','撤回成功','挂失撤回---肖家海---2021年08月29日 14时11分28秒',1),
(32,1,'挂失','2021-11-29 14:21:05','挂失','test-2021-11-29 14:14',1),
(33,1,'挂失撤回','2021-11-29 14:21:14','撤回成功','挂失撤回---肖家海---2021年21月29日 14时11分14秒',1),
(34,1,'挂失','2021-11-29 14:31:12','挂失','test',1),
(35,1,'挂失撤回','2021-11-29 14:31:33','撤回成功','挂失撤回---肖家海---2021年31月29日 14时11分33秒',1),
(36,2,'创建','2021-12-02 21:16:43','创建成功','无',1),
(37,2,'挂失','2021-12-02 21:56:48','挂失','111',1),
(40,2,'挂失撤回','2021-12-02 22:15:46','撤回成功','挂失撤回---项若颖---2021年15月02日 22时12分46秒',1),
(41,1,'挂失','2021-12-03 20:57:22','挂失','1test',1),
(42,1,'挂失撤回','2021-12-03 20:58:04','撤回成功','挂失撤回---肖家海---2021年58月03日 20时12分04秒',1),
(43,1,'挂失','2021-12-03 23:00:52','挂失','111',1),
(44,1,'挂失','2021-12-04 15:50:35','挂失','test',1),
(45,1,'IC卡注销','2021-12-04 16:15:46','注销成功','注销',1),
(46,3,'创建','2021-12-04 16:30:29','创建成功','无',1),
(47,2,'IC卡注销','2021-12-04 16:42:22','注销成功','注销',1),
(48,3,'IC卡注销','2021-12-04 16:56:27','注销成功','注销',1),
(49,2,'IC卡注销','2021-12-04 16:59:15','注销成功','注销',1),
(50,4,'创建','2021-12-04 17:06:07','创建成功','无',1),
(51,5,'创建','2021-12-05 10:06:26','创建成功','无',1);

/*Table structure for table `ic_card_msg` */

DROP TABLE IF EXISTS `ic_card_msg`;

CREATE TABLE `ic_card_msg` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `card_id` bigint(225) DEFAULT NULL COMMENT '卡id',
  `user_id` bigint(225) DEFAULT NULL COMMENT '用户id',
  `status` int(11) DEFAULT '1' COMMENT '状态码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_card_msg` */

insert  into `ic_card_msg`(`id`,`card_id`,`user_id`,`status`) values 
(1,1,10,1),
(4,3,10,1),
(5,2,2,1),
(7,4,2,1),
(8,5,10,1);

/*Table structure for table `ic_card_type` */

DROP TABLE IF EXISTS `ic_card_type`;

CREATE TABLE `ic_card_type` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `type_name` varchar(225) DEFAULT NULL COMMENT '类型名称',
  `icon` varchar(225) DEFAULT NULL COMMENT '类型图标地址',
  `count` varchar(225) DEFAULT NULL COMMENT '类型消费折扣',
  `status` int(11) DEFAULT NULL COMMENT '状态码',
  `remark` varchar(255) DEFAULT NULL COMMENT '办卡说明（可办卡人员）',
  `msg` varchar(255) DEFAULT NULL COMMENT '卡信息',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_card_type` */

insert  into `ic_card_type`(`id`,`type_name`,`icon`,`count`,`status`,`remark`,`msg`) values 
(1,'普通卡','http://localhost:8080/nchkkjxy/staticRes/icon/icCardCreate/nomal.png','1',1,'任何人','任何人都能申请！充多少用多少，开心使用每一天！'),
(2,'军人卡','http://localhost:8080/nchkkjxy/staticRes/icon/icCardCreate/军人卡.png','0.6',1,'参军及退伍在伍人员','从军国荣！军人优先！军人依法享受优惠政策！'),
(3,'学生卡','http://localhost:8080/nchkkjxy/staticRes/icon/icCardCreate/student.png','0.6',1,'儿童、在校中小学生、大学生、研博生','学生福利！祖国的花朵，家庭的未来，你们值得期待！'),
(4,'老人卡','http://localhost:8080/nchkkjxy/staticRes/icon/icCardCreate/老人卡.png','0.6',1,'65岁以上中老年人','夕阳无限好，恰如当年青春时！'),
(5,'残疾卡','http://localhost:8080/nchkkjxy/staticRes/icon/icCardCreate/残疾卡.png','0.6',1,'残疾人包括健康状况不佳的人','关爱弱势群体是我们每个人的社会责任！点点滴滴更暖心！'),
(6,'VIP卡','http://localhost:8080/nchkkjxy/staticRes/icon/icCardCreate/vip.png','0.8',1,'在平台办理了vip的客户','Very Importent Personnel！您,是我们的上帝！');

/*Table structure for table `ic_consume_node` */

DROP TABLE IF EXISTS `ic_consume_node`;

CREATE TABLE `ic_consume_node` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `consume_money` varchar(225) DEFAULT NULL COMMENT '消费金额',
  `consume_date` varchar(225) DEFAULT NULL COMMENT '消费时间',
  `consume_goods_id` varchar(225) DEFAULT NULL COMMENT '消费商品id',
  `status` int(11) DEFAULT '0' COMMENT '0,表示消费',
  `blance` varchar(50) DEFAULT NULL COMMENT '消费后的余额',
  `consume_type` bigint(20) DEFAULT NULL COMMENT '消费类型id',
  `note` varchar(225) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_consume_node` */

insert  into `ic_consume_node`(`id`,`consume_money`,`consume_date`,`consume_goods_id`,`status`,`blance`,`consume_type`,`note`) values 
(1,'0.22','2021-11-13 15:22:55','1',1,'99.78',1,NULL),
(2,'55.00','2021-11-16 23:22:00','1',1,'44.78',2,NULL),
(3,'10.00','2021-11-16 23:42:00','1',1,'34.78',2,NULL);

/*Table structure for table `ic_consume_record` */

DROP TABLE IF EXISTS `ic_consume_record`;

CREATE TABLE `ic_consume_record` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `consume_id` varchar(225) DEFAULT NULL COMMENT '消费记录id',
  `consume_card_id` varchar(225) DEFAULT NULL COMMENT '消费卡id',
  `consume_user_id` varchar(225) DEFAULT NULL COMMENT '消费用户id',
  `status` int(11) DEFAULT NULL COMMENT '状态字',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_consume_record` */

insert  into `ic_consume_record`(`id`,`consume_id`,`consume_card_id`,`consume_user_id`,`status`) values 
(1,'1','1','10',1),
(2,'2','1','10',1),
(3,'3','1','10',1);

/*Table structure for table `ic_login_history` */

DROP TABLE IF EXISTS `ic_login_history`;

CREATE TABLE `ic_login_history` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `uid` bigint(20) NOT NULL COMMENT '用户登录账号id',
  `ip` varchar(64) DEFAULT NULL COMMENT '用户登录主机ip',
  `is_save` int(11) DEFAULT '1' COMMENT '是否保存登录信息到主机',
  `create_time` varchar(64) DEFAULT NULL COMMENT '创建时间',
  `save_times` int(11) DEFAULT '360000' COMMENT '保存时间(单位秒），默认10小时',
  `leavel` int(11) DEFAULT '0' COMMENT '是否默认登录（账号），0表示不默认登录',
  `status` int(11) DEFAULT '1' COMMENT '状态',
  PRIMARY KEY (`uid`),
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_login_history` */

insert  into `ic_login_history`(`id`,`uid`,`ip`,`is_save`,`create_time`,`save_times`,`leavel`,`status`) values 
(4,10,'127.0.0.1',1,'2021-12-08 22:30:38',18000,0,1);

/*Table structure for table `ic_main_authority` */

DROP TABLE IF EXISTS `ic_main_authority`;

CREATE TABLE `ic_main_authority` (
  `id` varchar(225) NOT NULL COMMENT '表id',
  `identify` varchar(225) DEFAULT NULL COMMENT '登录身份',
  `route` varchar(225) DEFAULT NULL COMMENT '可访问路由',
  `status` int(11) DEFAULT NULL COMMENT '状态码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_main_authority` */

/*Table structure for table `ic_main_easy_user` */

DROP TABLE IF EXISTS `ic_main_easy_user`;

CREATE TABLE `ic_main_easy_user` (
  `id` bigint(50) NOT NULL AUTO_INCREMENT COMMENT '账号id',
  `easy_id` varchar(50) DEFAULT NULL COMMENT '用户账号名称',
  `password` varchar(50) DEFAULT NULL COMMENT '密码',
  `indentify` varchar(50) DEFAULT NULL COMMENT '用户身份',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_main_easy_user` */

insert  into `ic_main_easy_user`(`id`,`easy_id`,`password`,`indentify`) values 
(2,'188207207','123456','开发者'),
(3,'188206140','123456','开发者'),
(4,'188206119','123456','开发者'),
(5,'188206107','123456','开发者'),
(10,'xjh','111','开发者'),
(11,'14789654586','x123456','普通用户'),
(12,'19963574852','x123456','普通用户'),
(13,'19970246512','x123456','普通用户');

/*Table structure for table `ic_main_route` */

DROP TABLE IF EXISTS `ic_main_route`;

CREATE TABLE `ic_main_route` (
  `id` varchar(225) NOT NULL COMMENT '表id',
  `route_id` varchar(225) DEFAULT NULL COMMENT '路由id',
  `parent_route_id` varchar(225) DEFAULT NULL COMMENT '父级路由id',
  `status` int(11) DEFAULT NULL COMMENT '状态码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_main_route` */

/*Table structure for table `ic_main_route_msg` */

DROP TABLE IF EXISTS `ic_main_route_msg`;

CREATE TABLE `ic_main_route_msg` (
  `id` varchar(225) NOT NULL COMMENT '表id',
  `route_name` varchar(225) DEFAULT NULL COMMENT '路由名称',
  `route_url` varchar(225) DEFAULT NULL COMMENT '路由连接',
  `route_icon` varchar(225) DEFAULT NULL COMMENT '路由图标',
  `route_grade` varchar(225) DEFAULT NULL COMMENT '路由等级',
  `status` int(11) DEFAULT NULL COMMENT '状态码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_main_route_msg` */

/*Table structure for table `ic_main_user` */

DROP TABLE IF EXISTS `ic_main_user`;

CREATE TABLE `ic_main_user` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `easy_id` bigint(20) DEFAULT NULL COMMENT '登录信息id',
  `name` varchar(50) DEFAULT NULL COMMENT '姓名',
  `identify_card` varchar(225) DEFAULT NULL COMMENT '身份证',
  `phone` varchar(50) DEFAULT NULL COMMENT '手机',
  `email` varchar(225) DEFAULT NULL COMMENT '邮箱',
  `brithday` varchar(50) DEFAULT NULL COMMENT '生日',
  `sex` varchar(50) DEFAULT '男' COMMENT '性别',
  `head_url` varchar(225) DEFAULT 'http://localhost:8080/nchkkjxy/pic/head_icon/defult.png' COMMENT '头像地址',
  `single` varchar(512) DEFAULT '<font style=''color:#ccc;''>此用户很懒，什么都不写</font>' COMMENT '个性签名',
  `register_identify` varchar(225) DEFAULT '普通用户' COMMENT '注册身份',
  `user_status` varchar(50) DEFAULT '1' COMMENT '用户状态',
  `money_balance` varchar(225) DEFAULT '0.00' COMMENT '钱包余额',
  `node_status` varchar(50) DEFAULT '1' COMMENT '记录结点状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_main_user` */

insert  into `ic_main_user`(`id`,`easy_id`,`name`,`identify_card`,`phone`,`email`,`brithday`,`sex`,`head_url`,`single`,`register_identify`,`user_status`,`money_balance`,`node_status`) values 
(1,10,'肖家海','362430199999999999','15770674965','2749984520@qq.com','2021-11-01','男','http://localhost:8080/nchkkjxy//upload/img/2021_52_24_09_11_08_3e716a2b-9649-4880-90ba-5bd104ef285d.png','喜欢敲代码！哈哈哈~~~hh','开发者','1','222.00','1'),
(2,11,'张四','362403655984215412','19970246855','123@qq.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult.png','hello','普通用户','1','0.06','1'),
(3,12,'张四','362403655984215411','19970246858','123@qq.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult.png','hello','普通用户','1','0.00','1'),
(4,13,'张四','362403655984215413','19970246851','123@qq.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult.png','hello','普通用户','1','0.00','1'),
(5,14,'liuzhiq','362431199901235478','15770674999','23@123.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult.png','sss','普通用户','1','0.00','1'),
(6,15,'wu','365274122854725481','15770674911','sdada@qq.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult.png','qq','普通用户','1','0.00','1'),
(7,16,'sss','365412588975421542','19970256541','ss@123.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult.png','ss','普通用户','1','0.00','1'),
(8,17,'helloKitty','362457899876545247','15774698742','123@123.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_woman.png','hh','普通用户','1','0.00','1'),
(9,18,'helloKitty','362457899876545287','15770689547','123@123.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','hh','普通用户','1','0.00','1'),
(10,19,'helloKitty','362457899876545669','15770689523','123@123.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','hh','普通用户','1','0.00','1'),
(11,20,'zhang','362430188802152451','19970246857',NULL,'2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','<font style=\'color:#ccc;\'>此用户很懒，什么都不写</font>','普通用户','1','0.00','1'),
(12,21,'zhang','362430199914521452','15770665421',NULL,'2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','<font style=\'color:#ccc;\'>此用户很懒，什么都不写</font>','普通用户','1','0.00','1'),
(13,22,'xmen','362415277952485624','19986752345','123456@123.com','2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','hello Kitty!','普通用户','1','0.00','1'),
(14,23,'yyy','215478966325012457','19965874215',NULL,'2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','<font style=\'color:#ccc;\'>此用户很懒，什么都不写</font>','普通用户','1','0.00','1'),
(15,24,NULL,'545434455434543456','19987654321',NULL,'2000-12-01','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','<font style=\'color:#ccc;\'>此用户很懒，什么都不写</font>','普通用户','1','0.00','1'),
(16,2,'项若颖','333333333333333333','15777777771','2749984520@qq.com','2021-11-19','女','http://localhost:8080/nchkkjxy/pic/head_icon/defult_woman.png','没有个性也是一种个性！','开发者','1','2.00','1'),
(18,3,'郑子豪','433333333333333333','1577777772','111@124.com','3333-33-34','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','没有个性也是一种个性！','开发者','1','0.00','1'),
(19,4,'卢正豪','533333333333333333','15777777773','111@125.com','3333-33-35','男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','没有个性也是一种个性！','开发者','1','0.00','1'),
(20,5,'晏慧君','633333333333333333','15777777774','111@126.com','3333-33-36','女','http://localhost:8080/nchkkjxy/pic/head_icon/defult_woman.png','没有个性也是一种个性！','开发者','1','0.00','1'),
(21,11,'吃吃吃','382162199108152142','14789654586','222@cc.com',NULL,'女','http://localhost:8080/nchkkjxy/pic/head_icon/defult_woman.png','就知道吃','普通用户','1','0.00','1'),
(22,12,'京津冀','325496588742153654','19963574852','111@qq.com',NULL,'男','http://localhost:8080/nchkkjxy/pic/head_icon/defult_man.png','北上广不相信眼泪','普通用户','1','0.00','1'),
(23,13,'vv','365248466520213651','19970246512','bbb@qq.com','2021-11-05','女','http://localhost:8080/nchkkjxy/pic/head_icon/defult_woman.png','uuu','普通用户','1','0.00','1');

/*Table structure for table `ic_main_user_balance_log` */

DROP TABLE IF EXISTS `ic_main_user_balance_log`;

CREATE TABLE `ic_main_user_balance_log` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '记录的id',
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户账号id',
  `money` varchar(50) DEFAULT NULL COMMENT '变更的金额',
  `type` varchar(50) DEFAULT NULL COMMENT '变更的类型名称',
  `time` varchar(50) DEFAULT NULL COMMENT '变更的时间',
  `balance` varchar(50) DEFAULT NULL COMMENT '变更后的余额',
  `operator_user` bigint(20) DEFAULT NULL COMMENT '操作人的id',
  `ip_host` varchar(50) DEFAULT NULL COMMENT '操作的主机',
  `status` int(11) DEFAULT '1' COMMENT '记录的状态字',
  `note` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=248 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_main_user_balance_log` */

insert  into `ic_main_user_balance_log`(`id`,`user_id`,`money`,`type`,`time`,`balance`,`operator_user`,`ip_host`,`status`,`note`) values 
(1,10,'0.01','签到','2021-11-14 11:07:41','100.01',10,'192.168.102.1',1,'每日签到'),
(2,10,'0.01','签到','2021-11-14 11:10:30','0.23',10,'192.168.102.1',1,'每日签到'),
(3,10,'0.01','签到','2021-11-14 11:11:18','0.23',10,'192.168.102.1',1,'每日签到'),
(4,10,'0.01','签到','2021-11-14 11:11:19','0.23',10,'192.168.102.1',1,'每日签到'),
(5,10,'0.01','签到','2021-11-14 11:11:19','0.23',10,'192.168.102.1',1,'每日签到'),
(6,10,'0.01','签到','2021-11-14 11:11:20','0.23',10,'192.168.102.1',1,'每日签到'),
(7,10,'0.01','签到','2021-11-14 11:11:20','0.23',10,'192.168.102.1',1,'每日签到'),
(8,10,'0.01','签到','2021-11-14 11:11:20','0.23',10,'192.168.102.1',1,'每日签到'),
(9,10,'0.01','签到','2021-11-14 11:11:20','0.23',10,'192.168.102.1',1,'每日签到'),
(10,10,'0.01','签到','2021-11-14 11:11:20','0.23',10,'192.168.102.1',1,'每日签到'),
(11,10,'0.01','签到','2021-11-14 11:11:20','0.23',10,'192.168.102.1',1,'每日签到'),
(12,10,'0.01','签到','2021-11-14 11:11:21','0.23',10,'192.168.102.1',1,'每日签到'),
(13,10,'0.01','签到','2021-11-14 11:11:21','0.23',10,'192.168.102.1',1,'每日签到'),
(14,10,'0.01','签到','2021-11-14 11:11:21','0.23',10,'192.168.102.1',1,'每日签到'),
(15,10,'0.01','签到','2021-11-14 11:11:21','0.23',10,'192.168.102.1',1,'每日签到'),
(16,10,'0.01','签到','2021-11-14 11:11:22','0.23',10,'192.168.102.1',1,'每日签到'),
(17,10,'0.01','签到','2021-11-14 11:11:22','0.23',10,'192.168.102.1',1,'每日签到'),
(18,10,'0.01','签到','2021-11-14 11:11:23','0.23',10,'192.168.102.1',1,'每日签到'),
(19,10,'0.01','签到','2021-11-14 11:11:23','0.23',10,'192.168.102.1',1,'每日签到'),
(20,10,'0.01','签到','2021-11-14 11:11:23','0.23',10,'192.168.102.1',1,'每日签到'),
(21,10,'0.01','签到','2021-11-14 11:11:23','0.23',10,'192.168.102.1',1,'每日签到'),
(22,10,'0.01','签到','2021-11-14 11:11:23','0.23',10,'192.168.102.1',1,'每日签到'),
(23,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(24,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(25,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(26,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(27,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(28,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(29,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(30,10,'0.01','签到','2021-11-14 11:11:24','0.23',10,'192.168.102.1',1,'每日签到'),
(31,10,'0.01','签到','2021-11-14 11:11:25','0.23',10,'192.168.102.1',1,'每日签到'),
(32,10,'0.01','签到','2021-11-14 11:11:25','0.23',10,'192.168.102.1',1,'每日签到'),
(33,10,'0.01','签到','2021-11-14 11:11:25','0.23',10,'192.168.102.1',1,'每日签到'),
(34,10,'0.01','签到','2021-11-14 11:11:25','0.23',10,'192.168.102.1',1,'每日签到'),
(35,10,'0.01','签到','2021-11-14 11:11:25','0.23',10,'192.168.102.1',1,'每日签到'),
(36,10,'0.01','签到','2021-11-14 11:11:25','0.23',10,'192.168.102.1',1,'每日签到'),
(37,10,'0.01','充值','2021-11-14 11:13:33','100.22',10,'192.168.102.1',1,'充值'),
(38,10,'0.01','充值','2021-11-14 11:16:45','100.22',10,'192.168.102.1',1,'充值'),
(39,10,'0.01','充值','2021-11-14 11:19:59','100.22',10,'192.168.102.1',1,'充值'),
(40,10,'0.01','充值','2021-11-14 11:21:18','200.22',10,'192.168.102.1',1,'充值'),
(41,10,'0.01','充值','2021-11-14 11:57:22','300.22',10,'192.168.102.1',1,'充值'),
(42,10,'0.01','充值','2021-11-14 11:58:23','210.22',10,'192.168.102.1',1,'充值'),
(43,10,'0.01','签到','2021-11-14 12:57:32','200.23',10,'127.0.0.1',1,'日常签到'),
(44,10,'0.01','签到','2021-11-14 12:57:37','200.23',10,'127.0.0.1',1,'日常签到'),
(45,10,'0.01','签到','2021-11-14 12:57:38','200.23',10,'127.0.0.1',1,'日常签到'),
(46,10,'0.01','签到','2021-11-14 12:57:38','200.23',10,'127.0.0.1',1,'日常签到'),
(47,10,'0.01','签到','2021-11-14 12:57:38','200.23',10,'127.0.0.1',1,'日常签到'),
(48,10,'0.01','签到','2021-11-14 12:57:39','200.23',10,'127.0.0.1',1,'日常签到'),
(49,10,'0.01','签到','2021-11-14 12:59:11','200.23',10,'127.0.0.1',1,'日常签到'),
(51,10,'0.01','签到','2021-11-14 13:14:30','200.23',10,'127.0.0.1',1,'日常签到'),
(52,10,'0.01','签到','2021-11-14 13:14:40','200.23999999999998',10,'127.0.0.1',1,'日常签到'),
(53,10,'0.01','签到','2021-11-14 13:15:04','200.25',10,'127.0.0.1',1,'日常签到'),
(54,10,'0.01','签到','2021-11-14 13:16:12','200.26',10,'127.0.0.1',1,'日常签到'),
(55,10,'0.01','签到','2021-11-14 13:16:12','200.26999999999998',10,'127.0.0.1',1,'日常签到'),
(56,10,'0.01','签到','2021-11-14 13:16:12','200.26999999999998',10,'127.0.0.1',1,'日常签到'),
(60,10,'0.01','签到','2021-11-14 13:16:12','200.26999999999998',10,'127.0.0.1',1,'日常签到'),
(61,10,'0.01','签到','2021-11-14 13:16:17','200.26999999999998',10,'127.0.0.1',1,'日常签到'),
(62,10,'0.01','签到','2021-11-14 13:16:19','200.28',10,'127.0.0.1',1,'日常签到'),
(63,10,'0.01','签到','2021-11-14 13:16:20','200.29',10,'127.0.0.1',1,'日常签到'),
(64,10,'0.01','签到','2021-11-14 13:16:21','200.29999999999998',10,'127.0.0.1',1,'日常签到'),
(65,10,'0.01','签到','2021-11-14 13:16:22','200.31',10,'127.0.0.1',1,'日常签到'),
(66,10,'0.01','签到','2021-11-14 13:16:23','200.32',10,'127.0.0.1',1,'日常签到'),
(67,10,'0.01','签到','2021-11-14 13:16:23','200.32999999999998',10,'127.0.0.1',1,'日常签到'),
(68,10,'0.01','签到','2021-11-14 13:16:24','200.32999999999998',10,'127.0.0.1',1,'日常签到'),
(69,10,'0.01','签到','2021-11-14 13:16:24','200.34',10,'127.0.0.1',1,'日常签到'),
(70,10,'0.01','签到','2021-11-14 13:16:25','200.35',10,'127.0.0.1',1,'日常签到'),
(71,10,'0.01','签到','2021-11-14 13:16:25','200.35999999999999',10,'127.0.0.1',1,'日常签到'),
(72,10,'0.01','签到','2021-11-14 13:16:25','200.35999999999999',10,'127.0.0.1',1,'日常签到'),
(73,10,'0.01','签到','2021-11-14 13:16:25','200.35999999999999',10,'127.0.0.1',1,'日常签到'),
(74,10,'0.01','签到','2021-11-14 13:16:26','200.35999999999999',10,'127.0.0.1',1,'日常签到'),
(75,10,'0.01','签到','2021-11-14 13:16:26','200.37',10,'127.0.0.1',1,'日常签到'),
(76,10,'0.01','签到','2021-11-14 13:16:26','200.38',10,'127.0.0.1',1,'日常签到'),
(77,10,'0.01','签到','2021-11-14 13:16:26','200.39',10,'127.0.0.1',1,'日常签到'),
(78,10,'0.01','签到','2021-11-14 13:16:26','200.39999999999998',10,'127.0.0.1',1,'日常签到'),
(79,10,'0.01','签到','2021-11-14 13:16:27','200.41',10,'127.0.0.1',1,'日常签到'),
(80,10,'0.01','签到','2021-11-14 13:16:27','200.42',10,'127.0.0.1',1,'日常签到'),
(81,10,'0.01','签到','2021-11-14 13:16:27','200.42',10,'127.0.0.1',1,'日常签到'),
(82,10,'0.01','签到','2021-11-14 13:16:27','200.42',10,'127.0.0.1',1,'日常签到'),
(83,10,'0.01','签到','2021-11-14 13:16:27','200.42',10,'127.0.0.1',1,'日常签到'),
(84,10,'0.01','签到','2021-11-14 13:16:28','200.42',10,'127.0.0.1',1,'日常签到'),
(85,10,'0.01','签到','2021-11-14 13:16:28','200.42999999999998',10,'127.0.0.1',1,'日常签到'),
(86,10,'0.01','签到','2021-11-14 13:17:29','200.44',10,'127.0.0.1',1,'日常签到'),
(87,10,'0.01','签到','2021-11-14 13:31:29','200.45',10,'127.0.0.1',1,'日常签到'),
(88,10,'0.01','充值','2021-11-14 13:44:49','210.45',10,'192.168.102.1',1,'充值'),
(89,10,'0.01','签到','2021-11-14 15:03:03','200.45999999999998',10,'127.0.0.1',1,'日常签到'),
(90,10,'0.01','签到','2021-11-14 15:23:30','200.47',10,'127.0.0.1',1,'日常签到'),
(91,10,'0.01','签到','2021-11-14 15:23:32','200.48',10,'127.0.0.1',1,'日常签到'),
(92,10,'10','充值','2021-11-14 15:26:26','210.48',10,'192.168.102.1',1,'充值'),
(93,10,'10.00','充值','2021-11-14 15:27:22','210.48',10,'192.168.102.1',1,'充值'),
(94,10,'0.01','签到','2021-11-14 15:39:16','200.48999999999998',10,'127.0.0.1',1,'日常签到'),
(95,10,'0.01','签到','2021-11-14 15:39:22','200.5',10,'127.0.0.1',1,'日常签到'),
(96,10,'0.01','签到','2021-11-14 15:52:46','200.51',10,'127.0.0.1',1,'日常签到'),
(97,10,'0.01','签到','2021-11-14 15:52:52','200.51999999999998',10,'127.0.0.1',1,'日常签到'),
(98,10,'0.01','签到','2021-11-14 15:52:54','200.53',10,'127.0.0.1',1,'日常签到'),
(99,10,'0.01','签到','2021-11-14 15:52:56','200.54',10,'127.0.0.1',1,'日常签到'),
(100,10,'0.01','签到','2021-11-14 15:52:58','200.54999999999998',10,'127.0.0.1',1,'日常签到'),
(101,10,'0.01','签到','2021-11-14 15:53:00','200.56',10,'127.0.0.1',1,'日常签到'),
(102,10,'0.01','签到','2021-11-14 15:53:02','200.57',10,'127.0.0.1',1,'日常签到'),
(103,10,'0.01','签到','2021-11-14 15:53:04','200.57999999999998',10,'127.0.0.1',1,'日常签到'),
(104,10,'0.01','签到','2021-11-14 15:53:05','200.59',10,'127.0.0.1',1,'日常签到'),
(105,10,'0.01','签到','2021-11-14 15:53:07','200.6',10,'127.0.0.1',1,'日常签到'),
(106,10,'0.01','签到','2021-11-14 15:53:09','200.60999999999999',10,'127.0.0.1',1,'日常签到'),
(107,10,'0.01','签到','2021-11-14 15:57:39','200.62',10,'127.0.0.1',1,'日常签到'),
(108,10,'0.01','签到','2021-11-14 16:07:02','200.63',10,'127.0.0.1',1,'日常签到'),
(109,10,'0.01','签到','2021-11-14 16:07:06','200.64',10,'127.0.0.1',1,'日常签到'),
(110,10,'0.01','签到','2021-11-14 16:07:08','200.64999999999998',10,'127.0.0.1',1,'日常签到'),
(111,10,'0.01','签到','2021-11-14 16:07:13','200.66',10,'127.0.0.1',1,'日常签到'),
(112,10,'0.01','签到','2021-11-14 16:07:14','200.67',10,'127.0.0.1',1,'日常签到'),
(113,10,'0.01','签到','2021-11-14 16:07:16','200.67999999999998',10,'127.0.0.1',1,'日常签到'),
(114,10,'0.01','签到','2021-11-14 16:07:17','200.69',10,'127.0.0.1',1,'日常签到'),
(115,10,'0.01','签到','2021-11-14 16:07:17','200.7',10,'127.0.0.1',1,'日常签到'),
(116,10,'0.01','签到','2021-11-14 16:07:20','200.7',10,'127.0.0.1',1,'日常签到'),
(117,10,'0.01','签到','2021-11-14 16:08:11','200.70999999999998',10,'127.0.0.1',1,'日常签到'),
(118,10,'0.01','签到','2021-11-14 16:08:12','200.72',10,'127.0.0.1',1,'日常签到'),
(119,10,'0.01','签到','2021-11-14 16:08:12','200.73',10,'127.0.0.1',1,'日常签到'),
(120,10,'0.01','签到','2021-11-14 16:08:14','200.73999999999998',10,'127.0.0.1',1,'日常签到'),
(121,10,'0.01','签到','2021-11-14 16:08:16','200.75',10,'127.0.0.1',1,'日常签到'),
(122,10,'0.01','签到','2021-11-14 16:08:17','200.76',10,'127.0.0.1',1,'日常签到'),
(123,10,'0.01','签到','2021-11-14 16:08:18','200.76999999999998',10,'127.0.0.1',1,'日常签到'),
(124,10,'0.01','签到','2021-11-14 16:08:19','200.78',10,'127.0.0.1',1,'日常签到'),
(125,10,'0.01','签到','2021-11-14 16:08:20','200.79',10,'127.0.0.1',1,'日常签到'),
(126,10,'0.01','签到','2021-11-14 16:08:21','200.79999999999998',10,'127.0.0.1',1,'日常签到'),
(127,10,'0.01','签到','2021-11-14 16:08:22','200.81',10,'127.0.0.1',1,'日常签到'),
(128,10,'0.01','签到','2021-11-14 16:08:22','200.82',10,'127.0.0.1',1,'日常签到'),
(129,10,'0.01','签到','2021-11-14 16:08:22','200.82999999999998',10,'127.0.0.1',1,'日常签到'),
(130,10,'0.01','签到','2021-11-14 16:08:22','200.84',10,'127.0.0.1',1,'日常签到'),
(131,10,'0.01','签到','2021-11-14 16:08:22','200.85',10,'127.0.0.1',1,'日常签到'),
(132,10,'0.01','签到','2021-11-14 16:08:23','200.85999999999999',10,'127.0.0.1',1,'日常签到'),
(133,10,'0.01','签到','2021-11-14 16:08:23','200.87',10,'127.0.0.1',1,'日常签到'),
(134,10,'0.01','签到','2021-11-14 16:08:23','200.87',10,'127.0.0.1',1,'日常签到'),
(135,10,'0.01','签到','2021-11-14 16:08:23','200.87',10,'127.0.0.1',1,'日常签到'),
(136,10,'0.01','签到','2021-11-14 16:08:23','200.87',10,'127.0.0.1',1,'日常签到'),
(137,10,'0.01','签到','2021-11-14 16:08:23','200.87',10,'127.0.0.1',1,'日常签到'),
(138,10,'0.01','签到','2021-11-14 16:08:24','200.87',10,'127.0.0.1',1,'日常签到'),
(139,10,'0.01','签到','2021-11-14 16:08:24','200.88',10,'127.0.0.1',1,'日常签到'),
(140,10,'0.01','签到','2021-11-14 16:08:24','200.89',10,'127.0.0.1',1,'日常签到'),
(141,10,'0.01','签到','2021-11-14 16:18:10','200.89999999999998',10,'127.0.0.1',1,'日常签到'),
(142,10,'0.01','签到','2021-11-14 16:18:13','200.91',10,'127.0.0.1',1,'日常签到'),
(143,10,'0.01','签到','2021-11-14 16:18:14','200.92',10,'127.0.0.1',1,'日常签到'),
(144,10,'0.01','签到','2021-11-14 16:18:14','200.92999999999998',10,'127.0.0.1',1,'日常签到'),
(145,10,'0.01','签到','2021-11-14 16:18:15','200.92999999999998',10,'127.0.0.1',1,'日常签到'),
(146,10,'0.01','签到','2021-11-14 16:18:15','200.94',10,'127.0.0.1',1,'日常签到'),
(147,10,'0.01','签到','2021-11-14 16:18:16','200.95',10,'127.0.0.1',1,'日常签到'),
(148,10,'0.01','签到','2021-11-14 16:18:16','200.95999999999998',10,'127.0.0.1',1,'日常签到'),
(149,10,'0.01','签到','2021-11-14 16:18:16','200.95999999999998',10,'127.0.0.1',1,'日常签到'),
(150,10,'0.01','签到','2021-11-14 16:18:16','200.95999999999998',10,'127.0.0.1',1,'日常签到'),
(151,10,'0.01','签到','2021-11-14 16:18:17','200.95999999999998',10,'127.0.0.1',1,'日常签到'),
(152,10,'0.01','签到','2021-11-14 16:18:17','200.97',10,'127.0.0.1',1,'日常签到'),
(153,10,'0.01','签到','2021-11-14 16:18:18','200.98',10,'127.0.0.1',1,'日常签到'),
(154,10,'0.01','签到','2021-11-14 16:18:18','200.98999999999998',10,'127.0.0.1',1,'日常签到'),
(155,10,'0.01','签到','2021-11-14 16:18:19','200.98999999999998',10,'127.0.0.1',1,'日常签到'),
(156,10,'0.01','签到','2021-11-14 16:18:19','201',10,'127.0.0.1',1,'日常签到'),
(157,10,'0.01','签到','2021-11-14 16:18:20','201.01',10,'127.0.0.1',1,'日常签到'),
(158,10,'0.01','签到','2021-11-14 16:18:20','201.01999999999998',10,'127.0.0.1',1,'日常签到'),
(159,10,'0.01','签到','2021-11-14 16:18:20','201.01999999999998',10,'127.0.0.1',1,'日常签到'),
(160,10,'0.01','签到','2021-11-14 16:18:21','201.01999999999998',10,'127.0.0.1',1,'日常签到'),
(161,10,'0.01','签到','2021-11-14 16:18:21','201.03',10,'127.0.0.1',1,'日常签到'),
(162,10,'0.01','签到','2021-11-14 16:18:21','201.04',10,'127.0.0.1',1,'日常签到'),
(163,10,'0.01','签到','2021-11-14 16:19:05','201.04999999999998',10,'127.0.0.1',1,'日常签到'),
(164,10,'0.01','签到','2021-11-14 16:19:09','201.06',10,'127.0.0.1',1,'日常签到'),
(165,10,'0.01','签到','2021-11-14 16:19:10','201.07',10,'127.0.0.1',1,'日常签到'),
(166,10,'0.01','签到','2021-11-14 16:19:11','201.07999999999998',10,'127.0.0.1',1,'日常签到'),
(167,10,'0.01','签到','2021-11-14 16:19:13','201.09',10,'127.0.0.1',1,'日常签到'),
(168,10,'0.01','签到','2021-11-14 16:19:14','201.1',10,'127.0.0.1',1,'日常签到'),
(169,10,'0.01','签到','2021-11-14 16:19:16','201.10999999999999',10,'127.0.0.1',1,'日常签到'),
(170,10,'0.01','签到','2021-11-14 16:19:17','201.12',10,'127.0.0.1',1,'日常签到'),
(171,10,'0.01','签到','2021-11-14 16:19:19','201.13',10,'127.0.0.1',1,'日常签到'),
(172,10,'0.01','签到','2021-11-14 16:19:20','201.14',10,'127.0.0.1',1,'日常签到'),
(173,10,'0.01','签到','2021-11-14 16:19:21','201.14999999999998',10,'127.0.0.1',1,'日常签到'),
(174,10,'0.01','签到','2021-11-14 16:19:22','201.16',10,'127.0.0.1',1,'日常签到'),
(175,10,'0.01','签到','2021-11-14 16:19:23','201.17',10,'127.0.0.1',1,'日常签到'),
(176,10,'0.01','签到','2021-11-14 20:04:25','201.17999999999998',10,'127.0.0.1',1,'日常签到'),
(177,10,'0.01','签到','2021-11-14 20:04:27','201.19',10,'127.0.0.1',1,'日常签到'),
(178,10,'0.01','签到','2021-11-14 20:04:30','201.2',10,'127.0.0.1',1,'日常签到'),
(179,10,'0.01','签到','2021-11-14 20:04:40','201.20999999999998',10,'127.0.0.1',1,'日常签到'),
(180,10,'0.01','签到','2021-11-14 20:08:19','201.22',10,'127.0.0.1',1,'日常签到'),
(181,10,'0.01','签到','2021-11-14 20:08:22','201.23',10,'127.0.0.1',1,'日常签到'),
(182,10,'0.01','签到','2021-11-14 20:08:24','201.23999999999998',10,'127.0.0.1',1,'日常签到'),
(183,10,'0.01','签到','2021-11-14 20:08:27','201.25',10,'127.0.0.1',1,'日常签到'),
(184,10,'0.01','签到','2021-11-14 20:08:29','201.26',10,'127.0.0.1',1,'日常签到'),
(185,10,'0.01','签到','2021-11-14 20:08:30','201.26999999999998',10,'127.0.0.1',1,'日常签到'),
(186,10,'0.01','签到','2021-11-14 20:08:33','201.28',10,'127.0.0.1',1,'日常签到'),
(187,10,'0.01','签到','2021-11-14 20:08:36','201.29',10,'127.0.0.1',1,'日常签到'),
(188,10,'0.01','签到','2021-11-14 20:08:37','201.29999999999998',10,'127.0.0.1',1,'日常签到'),
(189,10,'0.01','签到','2021-11-14 20:08:39','201.31',10,'127.0.0.1',1,'日常签到'),
(190,10,'0.01','签到','2021-11-14 20:08:41','201.32',10,'127.0.0.1',1,'日常签到'),
(191,10,'0.01','签到','2021-11-14 20:08:43','201.32999999999998',10,'127.0.0.1',1,'日常签到'),
(192,10,'0.01','签到','2021-11-14 20:08:45','201.34',10,'127.0.0.1',1,'日常签到'),
(193,10,'0.01','签到','2021-11-14 20:08:47','201.35',10,'127.0.0.1',1,'日常签到'),
(194,10,'0.01','签到','2021-11-14 20:09:01','201.35999999999999',10,'127.0.0.1',1,'日常签到'),
(195,10,'0.01','签到','2021-11-14 20:09:04','201.37',10,'127.0.0.1',1,'日常签到'),
(196,10,'0.01','签到','2021-11-14 20:09:15','201.38',10,'127.0.0.1',1,'日常签到'),
(197,10,'0.01','签到','2021-11-14 20:09:17','201.39',10,'127.0.0.1',1,'日常签到'),
(198,10,'0.01','签到','2021-11-14 20:09:21','201.39999999999998',10,'127.0.0.1',1,'日常签到'),
(199,10,'0.01','签到','2021-11-14 20:09:27','201.41',10,'127.0.0.1',1,'日常签到'),
(200,10,'0.01','签到','2021-11-14 20:11:53','201.42',10,'127.0.0.1',1,'日常签到'),
(201,10,'0.01','签到','2021-11-14 20:11:56','201.42999999999998',10,'127.0.0.1',1,'日常签到'),
(202,10,'0.01','签到','2021-11-14 20:11:59','201.44',10,'127.0.0.1',1,'日常签到'),
(203,10,'0.01','签到','2021-11-14 20:13:38','201.45',10,'127.0.0.1',1,'日常签到'),
(204,10,'0.01','签到','2021-11-14 20:13:41','201.45999999999998',10,'127.0.0.1',1,'日常签到'),
(205,10,'0.01','签到','2021-11-14 20:13:43','201.47',10,'127.0.0.1',1,'日常签到'),
(206,10,'0.01','签到','2021-11-14 20:13:46','201.48',10,'127.0.0.1',1,'日常签到'),
(207,10,'0.01','签到','2021-11-14 20:13:48','201.48999999999998',10,'127.0.0.1',1,'日常签到'),
(208,10,'0.01','签到','2021-11-14 20:13:50','201.5',10,'127.0.0.1',1,'日常签到'),
(209,10,'0.01','签到','2021-11-14 20:13:54','201.51',10,'127.0.0.1',1,'日常签到'),
(210,10,'0.01','签到','2021-11-14 20:13:56','201.51999999999998',10,'127.0.0.1',1,'日常签到'),
(211,10,'0.01','签到','2021-11-14 20:13:59','201.53',10,'127.0.0.1',1,'日常签到'),
(212,10,'0.01','签到','2021-11-14 20:14:02','201.54',10,'127.0.0.1',1,'日常签到'),
(213,10,'0.01','签到','2021-11-14 20:14:04','201.54999999999998',10,'127.0.0.1',1,'日常签到'),
(214,10,'0.01','签到','2021-11-14 20:14:08','201.56',10,'127.0.0.1',1,'日常签到'),
(215,10,'0.01','签到','2021-11-14 20:14:10','201.57',10,'127.0.0.1',1,'日常签到'),
(216,10,'0.01','签到','2021-11-14 20:14:23','201.57999999999998',10,'127.0.0.1',1,'日常签到'),
(217,10,'0.01','签到','2021-11-14 20:14:29','201.59',10,'127.0.0.1',1,'日常签到'),
(218,10,'0.01','签到','2021-11-14 20:14:32','201.6',10,'127.0.0.1',1,'日常签到'),
(219,10,'0.01','签到','2021-11-14 20:14:52','201.60999999999999',10,'127.0.0.1',1,'日常签到'),
(220,10,'0.01','签到','2021-11-14 20:15:49','201.62',10,'127.0.0.1',1,'日常签到'),
(221,10,'0.01','签到','2021-11-14 20:24:11','201.63',10,'127.0.0.1',1,'日常签到'),
(222,10,'0.01','签到','2021-11-15 09:20:55','201.64',10,'127.0.0.1',1,'日常签到'),
(223,10,'0.01','签到','2021-11-15 09:20:56','201.64999999999998',10,'127.0.0.1',1,'日常签到'),
(224,10,'0.01','签到','2021-11-16 15:05:10','201.66',10,'127.0.0.1',1,'日常签到'),
(225,10,'0.01','签到','2021-11-16 15:05:16','201.67',10,'127.0.0.1',1,'日常签到'),
(226,10,'0.01','签到','2021-11-18 21:10:59','201.67999999999998',10,'127.0.0.1',1,'日常签到'),
(227,10,'0.01','签到','2021-11-19 09:07:11','201.69',10,'127.0.0.1',1,'日常签到'),
(228,2,'0.01','签到','2021-11-19 20:50:33','0.01',2,'127.0.0.1',1,'日常签到'),
(229,2,'0.01','签到','2021-11-19 20:50:46','0.02',2,'127.0.0.1',1,'日常签到'),
(230,2,'0.01','签到','2021-11-19 20:50:51','0.03',2,'127.0.0.1',1,'日常签到'),
(231,2,'0.01','签到','2021-11-19 20:50:55','0.04',2,'127.0.0.1',1,'日常签到'),
(232,2,'0.01','签到','2021-11-19 20:50:59','0.05',2,'127.0.0.1',1,'日常签到'),
(233,2,'0.01','签到','2021-11-19 20:51:03','0.060000000000000005',2,'127.0.0.1',1,'日常签到'),
(234,2,'0.01','签到','2021-11-19 20:51:07','0.06999999999999999',2,'127.0.0.1',1,'日常签到'),
(235,2,'0.01','签到','2021-11-19 20:51:11','0.08',2,'127.0.0.1',1,'日常签到'),
(236,2,'0.01','签到','2021-11-20 08:38:41','0.09',2,'127.0.0.1',1,'日常签到'),
(237,10,'0.01','签到','2021-11-22 12:13:20','201.7',10,'127.0.0.1',1,'日常签到'),
(238,10,'0.01','签到','2021-11-26 11:16:19','201.70999999999998',10,'127.0.0.1',1,'日常签到'),
(239,10,'0.01','签到','2021-11-27 21:14:10','201.72',10,'127.0.0.1',1,'日常签到'),
(240,10,'100','卡注销资金变更','2021-11-29 10:23:54','212.00',10,'192.168.102.1',1,'卡注销资金变更'),
(241,10,'10.00','卡注销资金变更','2021-11-29 10:27:18','212.00',10,'192.168.102.1',1,'卡注销资金变更'),
(242,10,'0.01','签到','2021-11-29 14:37:12','212.01',10,'127.0.0.1',1,'日常签到'),
(243,10,'0.01','签到','2021-12-03 15:41:02','212.01999999999998',10,'127.0.0.1',1,'日常签到'),
(244,10,'10.00','卡注销资金变更','2021-12-04 16:15:29','222',10,'127.0.0.1',1,'卡注销资金变更'),
(245,2,'0.00','卡注销资金变更','2021-12-04 16:42:22','0.00',2,'127.0.0.1',1,'卡注销资金变更'),
(246,10,'0.00','卡注销资金变更','2021-12-04 16:56:27','222.00',10,'127.0.0.1',1,'卡注销资金变更'),
(247,2,'1','卡注销资金变更','2021-12-04 16:59:15','2.00',2,'127.0.0.1',1,'卡注销资金变更');

/*Table structure for table `ic_recharge_node` */

DROP TABLE IF EXISTS `ic_recharge_node`;

CREATE TABLE `ic_recharge_node` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '结点id',
  `recharge_money` varchar(225) DEFAULT NULL COMMENT '充值金额',
  `recharge_time` varchar(225) DEFAULT NULL COMMENT '充值时间',
  `status` int(11) DEFAULT '1' COMMENT '-1,表示消费',
  `blance` varchar(50) DEFAULT NULL COMMENT '充值后的余额',
  `note` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_recharge_node` */

insert  into `ic_recharge_node`(`id`,`recharge_money`,`recharge_time`,`status`,`blance`,`note`) values 
(1,'100','2021-11-13 12:55:20',1,'100',NULL),
(2,'2.22','2021-12-04 17:31:24',1,'3.45','充值'),
(3,'10.00','2021-12-04 21:41:56',1,'13.45',''),
(4,'10.00','2021-12-04 21:42:40',1,'23.45',''),
(6,'10.00','2021-12-04 21:48:25',1,'23.45',''),
(12,'10.00','2021-12-04 22:00:04',1,'33.45',''),
(13,'10.00','2021-12-04 22:02:59',1,'43.45',''),
(14,'10.00','2021-12-04 22:04:58',1,'53.45',''),
(15,'100.00','2021-12-04 22:10:02',1,'153.45','test'),
(16,'10.00','2021-12-04 22:10:31',1,'163.45','test'),
(17,'20.00','2021-12-04 22:11:25',1,'183.45','test'),
(18,'99.99','2021-12-04 22:11:38',1,'283.44',''),
(19,'0.01','2021-12-04 22:12:00',1,'283.45','test'),
(20,'100.00','2021-12-05 10:07:08',1,'100','首充100元'),
(21,'0.01','2021-12-05 10:07:26',1,'100.01','test'),
(22,'100.00','2021-12-05 13:14:10',1,'200.01',''),
(23,'100.00','2021-12-05 13:14:17',1,'300.01',''),
(24,'10000.00','2021-12-05 13:14:30',1,'10300.01',''),
(25,'9.99','2021-12-05 13:14:42',1,'10310',''),
(26,'9.06','2021-12-05 13:14:59',1,'10319.06',''),
(27,'250','2021-12-06 22:49:04',1,'10569.06','test');

/*Table structure for table `ic_recharge_record` */

DROP TABLE IF EXISTS `ic_recharge_record`;

CREATE TABLE `ic_recharge_record` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `recharge_id` varchar(225) DEFAULT NULL COMMENT '充值结点id',
  `card_id` varchar(225) DEFAULT NULL COMMENT '充值ic卡账号',
  `user_id` varchar(225) DEFAULT NULL COMMENT '充值人id',
  `status` int(11) DEFAULT NULL COMMENT '状态字',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_recharge_record` */

insert  into `ic_recharge_record`(`id`,`recharge_id`,`card_id`,`user_id`,`status`) values 
(1,'1','1','10',1),
(2,'2','4','2',1),
(3,NULL,'4','2',1),
(4,NULL,'4','2',1),
(5,NULL,'4','2',1),
(6,NULL,'4','2',1),
(7,NULL,'4','2',1),
(8,NULL,'4','2',1),
(9,NULL,'5','10',1),
(10,NULL,'5','10',1),
(11,NULL,'5','10',1),
(12,NULL,'5','10',1),
(13,NULL,'5','10',1),
(14,NULL,'5','10',1),
(15,NULL,'5','10',1),
(16,NULL,'5','10',1);

/*Table structure for table `ic_shopping_goods` */

DROP TABLE IF EXISTS `ic_shopping_goods`;

CREATE TABLE `ic_shopping_goods` (
  `id` bigint(225) NOT NULL AUTO_INCREMENT COMMENT '商品id',
  `goods_name` varchar(225) DEFAULT NULL COMMENT '商品名称',
  `icon` varchar(225) DEFAULT NULL COMMENT '商品icon',
  `unit_price` varchar(225) DEFAULT NULL COMMENT '商品单价',
  `extant` varchar(225) DEFAULT NULL COMMENT '商品现存',
  `inventory` varchar(225) DEFAULT NULL COMMENT '商品库存',
  `discount` varchar(225) DEFAULT NULL COMMENT '折扣',
  `title` varchar(225) DEFAULT NULL COMMENT '商品标签',
  `description` varchar(225) DEFAULT NULL COMMENT '商品描述',
  `is_special` varchar(225) DEFAULT NULL COMMENT '是否限时特价',
  `goods_class` bigint(20) DEFAULT NULL COMMENT '商品类型id',
  `status` int(11) DEFAULT '1' COMMENT '状态',
  `util` bigint(20) DEFAULT NULL COMMENT '价格单位',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_shopping_goods` */

insert  into `ic_shopping_goods`(`id`,`goods_name`,`icon`,`unit_price`,`extant`,`inventory`,`discount`,`title`,`description`,`is_special`,`goods_class`,`status`,`util`) values 
(2,'新西兰西兰花','http://localhost:8080/nchkkjxy/pic/main_page/card.png','9.99','49','100','1.0','蔬菜,进口,新鲜,美味,优惠,减肥,午餐必备,食品,','南昌蔬菜园','0',1,1,1),
(3,'葡萄牙酸葡萄','http://localhost:8080/nchkkjxy/pic/main_page/card.png','9.99','91','100','1.0','水果,进口,葡萄,维生素,减肥,好吃,大家喜欢,优惠购,食品,','南昌水果园','1',2,1,1),
(4,'南昌哈喇子','http://localhost:8080/nchkkjxy/pic/main_page/card.png','9.99','80','100','1.0','水果,葡萄,维生素,减肥,好吃,大家喜欢,优惠购,食品,','南昌水果园','0',2,1,1),
(5,'吉安菠萝','http://localhost:8080/nchkkjxy/pic/main_page/card.png','22.66','100','100','1.0','水果,葡萄,维生素,减肥,好吃,大家喜欢,优惠购,食品,','南昌水果园','1',2,1,1),
(6,'狗不理包子','http://localhost:8080/nchkkjxy/pic/main_page/card.png','108.99','10','100','1.0','蔬菜,进口,新鲜,美味,优惠,减肥,早餐必备','南昌包子铺','0',1,1,3),
(7,'好莱坞大红袍','http://localhost:8080/nchkkjxy/pic/main_page/card.png','1230.00','99','100','1.0','服装,进口,袍,修身,大咖,有钱人,大家喜欢,优惠购','义乌小商城','0',3,1,8),
(8,'小米钢笔','http://localhost:8080/nchkkjxy/pic/main_page/card.png','99.66','1','100','1.0','文具,高科技,小米,牛逼,好写,笔,优惠购','小米旗舰店','1',4,1,4),
(9,'老挝茄子','http://localhost:8080/nchkkjxy/pic/main_page/card.png','12.99','86','100','1.0','蔬菜,进口,新鲜,美味,优惠,减肥,早餐必备','万达广场-南昌店','0',1,1,3),
(10,'鸿星尔克跑步鞋NK-13','http://localhost:8080/nchkkjxy/pic/main_page/card.png','520.00','99','100','1.0','服装,国产,国货之光,跑步,运动鞋,大咖,有钱人,大家喜欢,优惠购','鸿星尔克旗舰店','0',3,1,8),
(11,'笔记本A4','http://localhost:8080/nchkkjxy/pic/main_page/card.png','25.00','85','160','0.8','文具,高科技,晨光,牛逼,好笔记本,漂亮,优惠购','小米旗舰店','1',4,1,4);

/*Table structure for table `ic_shopping_goods_tag` */

DROP TABLE IF EXISTS `ic_shopping_goods_tag`;

CREATE TABLE `ic_shopping_goods_tag` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '交易id',
  `goods_id` bigint(20) DEFAULT NULL COMMENT '商品id',
  `card_id` bigint(20) DEFAULT NULL COMMENT 'IC卡号',
  `shopping_time` varchar(225) DEFAULT NULL COMMENT '交易时间',
  `shopping_money` varchar(225) DEFAULT NULL COMMENT '交易金额',
  `status` int(11) DEFAULT NULL COMMENT '状态字',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_shopping_goods_tag` */

/*Table structure for table `ic_shopping_util_price` */

DROP TABLE IF EXISTS `ic_shopping_util_price`;

CREATE TABLE `ic_shopping_util_price` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `until` varchar(255) DEFAULT NULL COMMENT '单位（元/kg）等',
  `mark` varchar(255) DEFAULT NULL COMMENT '备注',
  `create_date` varchar(255) DEFAULT NULL COMMENT '创建时间',
  `create_user` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `delete_date` varchar(255) DEFAULT NULL COMMENT '删除时间',
  `delete_user` bigint(20) DEFAULT NULL COMMENT '删除人id',
  `status` int(11) DEFAULT '1' COMMENT '状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_shopping_util_price` */

insert  into `ic_shopping_util_price`(`id`,`until`,`mark`,`create_date`,`create_user`,`delete_date`,`delete_user`,`status`) values 
(1,'元/kg','标准单位','2021-12-07 12:00:00',1,NULL,NULL,1),
(2,'元/包','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(3,'元/斤','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(4,'元/根','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(5,'元/瓶','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(6,'元/ml','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(7,'元/g','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(8,'元/件','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1),
(9,'元/箱','标准单位','2021-12-07 12:00:00',10,NULL,NULL,1);

/*Table structure for table `ic_shopping_verify` */

DROP TABLE IF EXISTS `ic_shopping_verify`;

CREATE TABLE `ic_shopping_verify` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '记录id',
  `easy_id` bigint(20) NOT NULL COMMENT '用户id',
  `pwd` varchar(50) DEFAULT '123456' COMMENT '付款密码（6位数字密码）',
  `status` int(11) DEFAULT '1' COMMENT '状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_shopping_verify` */

insert  into `ic_shopping_verify`(`id`,`easy_id`,`pwd`,`status`) values 
(1,10,'123456',1);

/*Table structure for table `ic_user_leavel` */

DROP TABLE IF EXISTS `ic_user_leavel`;

CREATE TABLE `ic_user_leavel` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `leavel` int(11) DEFAULT NULL COMMENT '用户类型等级',
  `user_type` varchar(50) DEFAULT NULL COMMENT '用户类型',
  `create_data` varchar(50) DEFAULT NULL COMMENT '创建时间',
  `create_personal` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `del_data` varchar(50) DEFAULT NULL COMMENT '删除时间',
  `del_personal` bigint(20) DEFAULT NULL COMMENT '删除人id',
  `status` int(11) DEFAULT '1' COMMENT '记状态默认为1；0表示已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_user_leavel` */

insert  into `ic_user_leavel`(`id`,`leavel`,`user_type`,`create_data`,`create_personal`,`del_data`,`del_personal`,`status`) values 
(1,0,'普通用户','2021-09-12 09:33:00',10,NULL,NULL,1),
(2,10,'开发者','2021-11-20 09:44:00',10,NULL,NULL,1);

/*Table structure for table `ic_util_consume_type` */

DROP TABLE IF EXISTS `ic_util_consume_type`;

CREATE TABLE `ic_util_consume_type` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `type_name` varchar(50) DEFAULT NULL COMMENT '消费类型名称',
  `description` varchar(256) DEFAULT NULL COMMENT '描述',
  `icon` varchar(128) DEFAULT NULL COMMENT '图标地址',
  `create_data` varchar(50) DEFAULT NULL COMMENT '创建时间',
  `create_personal` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `del_date` varchar(50) DEFAULT NULL COMMENT '删除时间',
  `del_personal` bigint(20) DEFAULT NULL COMMENT '删除人id',
  `status` int(11) DEFAULT '1' COMMENT '记录状态，默认1，0表示删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_util_consume_type` */

insert  into `ic_util_consume_type`(`id`,`type_name`,`description`,`icon`,`create_data`,`create_personal`,`del_date`,`del_personal`,`status`) values 
(1,'出行','日常出行，地铁、公交、火车、飞机等均属于出行消费类型','#','2121-11-16 21:22:55',10,NULL,NULL,1),
(2,'饮食','人是铁，饭是钢，一顿不吃饿得慌。','#','2021-11-16 20:01:00',10,NULL,NULL,1),
(3,'学习','我爱学习，学习使我快乐','#','2021-11-17 8:01:00',10,NULL,NULL,1),
(4,'社交','敢社交，不社死','#','2021-11-17 10:16:04',10,NULL,NULL,1),
(5,'衣物','人靠衣裳马靠鞍','#','2021-11-17 10:19:46',10,NULL,NULL,1),
(6,'电子产品','电话是用来收取件码的，微信是用来打卡的，只有你是...','#','2021-11-17 10:19:47',10,NULL,NULL,1),
(7,'房租水电','今天你发了工资吗？房东又来催啦！！！','#','2021-11-17 10:19:47',10,NULL,NULL,1);

/*Table structure for table `ic_util_file` */

DROP TABLE IF EXISTS `ic_util_file`;

CREATE TABLE `ic_util_file` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '文件id',
  `file_name` varchar(128) DEFAULT NULL COMMENT '文件名称',
  `file_new_name` varchar(128) DEFAULT NULL COMMENT '文件新名称',
  `file_url` varchar(512) DEFAULT NULL COMMENT '文件地址',
  `has_del` int(11) DEFAULT '0' COMMENT '是否删除默认0，删除1',
  `status` int(11) DEFAULT '0' COMMENT '文件状态默认失效0，1为有效',
  `upload_time` varchar(64) DEFAULT NULL COMMENT '上传时间',
  `upload_user` bigint(20) DEFAULT NULL COMMENT '上传人id',
  `del_time` varchar(64) DEFAULT NULL COMMENT '删除时间',
  `del_user` bigint(20) DEFAULT NULL COMMENT '删除人id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_util_file` */

/*Table structure for table `ic_util_goods_type` */

DROP TABLE IF EXISTS `ic_util_goods_type`;

CREATE TABLE `ic_util_goods_type` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `type_name` varchar(32) DEFAULT NULL COMMENT '商品类型名称',
  `description` varchar(256) DEFAULT NULL COMMENT '描述',
  `icon` varchar(225) DEFAULT NULL COMMENT '图标地址',
  `create_data` varchar(50) DEFAULT NULL COMMENT '创建时间',
  `create_personal` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `del_data` varchar(50) DEFAULT NULL COMMENT '删除日期',
  `del_personal` bigint(20) DEFAULT NULL COMMENT '删除人id',
  `status` int(11) DEFAULT '1' COMMENT '状态默认1，0表示删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_util_goods_type` */

insert  into `ic_util_goods_type`(`id`,`type_name`,`description`,`icon`,`create_data`,`create_personal`,`del_data`,`del_personal`,`status`) values 
(1,'蔬菜','蔬菜','http://localhost:8080/nchkkjxy/pic/card/gou.png','2021-12-05 17:01:49',10,NULL,NULL,1),
(2,'水果','水果','http://localhost:8080/nchkkjxy/pic/card/gou.png','2021-12-05 17:02:06',10,NULL,NULL,1),
(3,'服装','服装','http://localhost:8080/nchkkjxy/pic/card/gou.png','2021-12-05 17:02:22',10,NULL,NULL,1),
(4,'学习用品','学习用品','http://localhost:8080/nchkkjxy/pic/card/gou.png','2021-12-05 17:02:34',10,NULL,NULL,1),
(5,'其他','其他','http://localhost:8080/nchkkjxy/pic/card/gou.png','2021-12-05 17:02:34',10,NULL,NULL,1);

/*Table structure for table `ic_util_router_navigation` */

DROP TABLE IF EXISTS `ic_util_router_navigation`;

CREATE TABLE `ic_util_router_navigation` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '记录id（路由id）',
  `title` varchar(30) NOT NULL COMMENT '显示文本',
  `url` varchar(256) NOT NULL COMMENT '路由地址',
  `icon` varchar(256) DEFAULT NULL COMMENT 'icon路径',
  `leavel` int(11) NOT NULL DEFAULT '0' COMMENT '路由可访问级别，0表示默认级别（任何人都可访问），大于0，越大时访问者需要权限月严格',
  `router_type` varchar(50) NOT NULL COMMENT '路由类型',
  `parent_router` bigint(20) DEFAULT NULL COMMENT '父级路由id',
  `create_time` varchar(50) DEFAULT NULL COMMENT '路由创建时间',
  `create_personal` bigint(20) DEFAULT NULL COMMENT '路由创建人id',
  `del_time` varchar(50) DEFAULT NULL COMMENT '路由删除时间',
  `del_personal` bigint(20) DEFAULT NULL COMMENT '路由删除id',
  `status` int(11) DEFAULT '1' COMMENT '路由状态默认1，0表示删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_util_router_navigation` */

insert  into `ic_util_router_navigation`(`id`,`title`,`url`,`icon`,`leavel`,`router_type`,`parent_router`,`create_time`,`create_personal`,`del_time`,`del_personal`,`status`) values 
(1,'主   页','#','iconfont icon-shouye',0,'主页',0,'2021-11-17 12:05:13',10,NULL,NULL,1),
(2,'个人消费','#','iconfont icon-gouwuche',0,'主页',0,'2021-11-17 12:05:13',10,NULL,NULL,1),
(3,'业务办理','#','iconfont icon-bumengaikuang',0,'主页',0,'2021-11-17 12:05:13',10,NULL,NULL,1),
(4,'我   的','#','iconfont icon-chanxueyanhezuo',0,'主页',0,'2021-11-17 12:05:13',10,NULL,NULL,1),
(5,'系   统','#','iconfont icon-shezhi',0,'主页',0,'2021-11-17 12:05:13',10,NULL,NULL,1),
(6,'余额','http://localhost:8080/nchkkjxy/navTo?url=home/personalConsume/balance','iconfont icon-wodezijin',0,'主页',2,'2021-11-17 12:18:48',10,NULL,NULL,1),
(7,'消费记录','http://localhost:8080/nchkkjxy/navTo?url=home/personalConsume/consumeNode','iconfont icon-shouxinxiangqing-xiaofeijilu',0,'主页',2,'2021-11-17 12:18:49',10,NULL,NULL,1),
(8,'充值提现','http://localhost:8080/nchkkjxy/navTo?url=home/personalConsume/resetDrawals','iconfont icon-chongzhi',0,'主页',2,'2021-11-17 12:18:49',10,NULL,NULL,1),
(9,'IC卡申领','http://localhost:8080/nchkkjxy/navTo?url=home/businessProcess/createIc','iconfont icon-kexuejishu',0,'主页',3,'2021-11-17 12:34:39',10,NULL,NULL,1),
(10,'IC卡挂失','http://localhost:8080/nchkkjxy/navTo?url=home/businessProcess/looseIc','iconfont icon-301guashishenqing-lv',0,'主页',3,'2021-11-17 12:34:39',10,NULL,NULL,1),
(11,'IC卡注销','http://localhost:8080/nchkkjxy/navTo?url=home/businessProcess/logoutIc','iconfont icon-chonghong-21',0,'主页',3,'2021-11-17 12:34:39',10,NULL,NULL,1),
(12,'业务记录','http://localhost:8080/nchkkjxy/navTo?url=home/businessProcess/businessNode','iconfont icon-shouxinxiangqing-xiaofeijilu',0,'主页',3,'2021-11-17 12:34:39',10,NULL,NULL,0),
(13,'个人信息','http://localhost:8080/nchkkjxy/navTo?url=home/mine/info','iconfont icon-xueshengziliao',0,'主页',4,'2021-11-17 12:40:03',10,NULL,NULL,1),
(14,'登录选项','http://localhost:8080/nchkkjxy/navTo?url=home/mine/loginChiose','iconfont icon-huidaodingbu',0,'主页',4,'2021-11-17 12:40:03',10,NULL,NULL,1),
(15,'退出系统','http://localhost:8080/nchkkjxy/navTo?url=home/mine/exit','iconfont icon-tuichudenglu',0,'主页',4,'2021-11-17 12:40:03',10,NULL,NULL,1),
(16,'关于我们','http://localhost:8080/nchkkjxy/navTo?url=home/system/our','iconfont icon-dollar-symbol',0,'主页',5,'2021-11-17 12:40:03',10,NULL,NULL,1),
(17,'使用手册','http://localhost:8080/nchkkjxy/navTo?url=home/system/useBook','iconfont icon-shiyongshouce_icon',0,'主页',5,'2021-11-17 12:40:04',10,NULL,NULL,1),
(18,'开发者','http://localhost:8080/nchkkjxy/navTo?url=home/system/author','iconfont icon-kaifazhe',0,'主页',5,'2021-11-17 12:40:04',10,NULL,NULL,1),
(19,'法律','http://localhost:8080/nchkkjxy/navTo?url=home/system/ligel','iconfont icon-falvshengmingfalv',0,'主页',5,'2021-11-17 12:40:04',10,NULL,NULL,1),
(20,'源码下载','https://gitee.com/code-on-top/ic-card-management-system','iconfont icon-kexuejishu2',0,'主页',5,'2021-11-28 13:55:00',10,NULL,NULL,1);

/*Table structure for table `ic_util_visitor` */

DROP TABLE IF EXISTS `ic_util_visitor`;

CREATE TABLE `ic_util_visitor` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '表id',
  `ip` varchar(64) DEFAULT NULL COMMENT '主机ip',
  `time` varchar(64) DEFAULT NULL COMMENT '访问时间',
  `name` varchar(64) DEFAULT NULL COMMENT '主机名称',
  `status` int(11) DEFAULT '1' COMMENT '记录状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=98 DEFAULT CHARSET=utf8mb4;

/*Data for the table `ic_util_visitor` */

insert  into `ic_util_visitor`(`id`,`ip`,`time`,`name`,`status`) values 
(12,'127.0.0.1','2021-12-08 22:06:42','',1),
(13,'127.0.0.1','2021-12-08 22:07:10','',1),
(14,'127.0.0.1','2021-12-08 22:07:39','',1),
(15,'127.0.0.1','2021-12-08 22:07:39','',1),
(16,'127.0.0.1','2021-12-08 22:07:59','',1),
(17,'127.0.0.1','2021-12-08 22:08:14','',1),
(18,'127.0.0.1','2021-12-08 22:08:14','',1),
(19,'127.0.0.1','2021-12-08 22:08:14','',1),
(20,'127.0.0.1','2021-12-08 22:08:17','',1),
(21,'127.0.0.1','2021-12-08 22:08:18','',1),
(22,'127.0.0.1','2021-12-08 22:08:18','',1),
(23,'127.0.0.1','2021-12-08 22:08:18','',1),
(24,'127.0.0.1','2021-12-08 22:08:18','',1),
(25,'127.0.0.1','2021-12-08 22:08:51','',1),
(26,'127.0.0.1','2021-12-08 22:08:52','10',1),
(27,'127.0.0.1','2021-12-08 22:08:55','',1),
(28,'127.0.0.1','2021-12-08 22:08:55','',1),
(29,'127.0.0.1','2021-12-08 22:08:55','',1),
(30,'127.0.0.1','2021-12-08 22:09:07','',1),
(31,'127.0.0.1','2021-12-08 22:09:08','',1),
(32,'127.0.0.1','2021-12-08 22:09:08','',1),
(33,'127.0.0.1','2021-12-08 22:09:08','',1),
(34,'127.0.0.1','2021-12-08 22:15:39','10',1),
(35,'127.0.0.1','2021-12-08 22:15:40','',1),
(36,'127.0.0.1','2021-12-08 22:15:40','',1),
(37,'127.0.0.1','2021-12-08 22:15:40','',1),
(38,'127.0.0.1','2021-12-08 22:15:43','',1),
(39,'127.0.0.1','2021-12-08 22:20:27','10',1),
(40,'127.0.0.1','2021-12-08 22:20:31','10',1),
(41,'127.0.0.1','2021-12-08 22:20:36','10',1),
(42,'127.0.0.1','2021-12-08 22:20:37','',1),
(43,'127.0.0.1','2021-12-08 22:20:37','',1),
(44,'127.0.0.1','2021-12-08 22:20:37','',1),
(45,'127.0.0.1','2021-12-08 22:20:42','',1),
(46,'127.0.0.1','2021-12-08 22:21:04','10',1),
(47,'127.0.0.1','2021-12-08 22:21:04','',1),
(48,'127.0.0.1','2021-12-08 22:21:04','10',1),
(49,'127.0.0.1','2021-12-08 22:21:06','',1),
(50,'127.0.0.1','2021-12-08 22:22:12','',1),
(51,'127.0.0.1','2021-12-08 22:22:12','10',1),
(52,'127.0.0.1','2021-12-08 22:22:12','10',1),
(53,'127.0.0.1','2021-12-08 22:22:16','',1),
(54,'127.0.0.1','2021-12-08 22:25:41','10',1),
(55,'127.0.0.1','2021-12-08 22:25:44','10',1),
(56,'127.0.0.1','2021-12-08 22:25:44','',1),
(57,'127.0.0.1','2021-12-08 22:25:44','',1),
(58,'127.0.0.1','2021-12-08 22:25:44','',1),
(59,'127.0.0.1','2021-12-08 22:25:50','',1),
(60,'127.0.0.1','2021-12-08 22:26:34','10',1),
(61,'127.0.0.1','2021-12-08 22:26:35','',1),
(62,'127.0.0.1','2021-12-08 22:26:35','10',1),
(63,'127.0.0.1','2021-12-08 22:26:40','',1),
(64,'127.0.0.1','2021-12-08 22:26:45','',1),
(65,'127.0.0.1','2021-12-08 22:26:49','',1),
(66,'127.0.0.1','2021-12-08 22:26:49','',1),
(67,'127.0.0.1','2021-12-08 22:26:49','',1),
(68,'127.0.0.1','2021-12-08 22:26:53','',1),
(69,'127.0.0.1','2021-12-08 22:26:55','',1),
(70,'127.0.0.1','2021-12-08 22:28:16','',1),
(71,'127.0.0.1','2021-12-08 22:28:16','',1),
(72,'127.0.0.1','2021-12-08 22:28:16','',1),
(73,'127.0.0.1','2021-12-08 22:28:18','',1),
(74,'127.0.0.1','2021-12-08 22:28:19','',1),
(75,'127.0.0.1','2021-12-08 22:28:24','',1),
(76,'127.0.0.1','2021-12-08 22:28:25','',1),
(77,'127.0.0.1','2021-12-08 22:28:25','',1),
(78,'127.0.0.1','2021-12-08 22:28:25','',1),
(79,'127.0.0.1','2021-12-08 22:28:25','',1),
(80,'127.0.0.1','2021-12-08 22:28:39','',1),
(81,'127.0.0.1','2021-12-08 22:28:40','',1),
(82,'127.0.0.1','2021-12-08 22:28:40','',1),
(83,'127.0.0.1','2021-12-08 22:28:40','',1),
(84,'127.0.0.1','2021-12-08 22:30:18','',1),
(85,'127.0.0.1','2021-12-08 22:30:27','',1),
(86,'127.0.0.1','2021-12-08 22:30:30','',1),
(87,'127.0.0.1','2021-12-08 22:30:31','',1),
(88,'127.0.0.1','2021-12-08 22:30:31','',1),
(89,'127.0.0.1','2021-12-08 22:30:31','',1),
(90,'127.0.0.1','2021-12-08 22:30:31','',1),
(91,'127.0.0.1','2021-12-08 22:30:34','',1),
(92,'127.0.0.1','2021-12-08 22:30:35','',1),
(93,'127.0.0.1','2021-12-08 22:30:37','',1),
(94,'127.0.0.1','2021-12-08 22:30:38','',1),
(95,'127.0.0.1','2021-12-08 22:30:38','',1),
(96,'127.0.0.1','2021-12-08 22:30:38','',1),
(97,'127.0.0.1','2021-12-08 22:30:38','',1);

/*Table structure for table `trade_goods_detail` */

DROP TABLE IF EXISTS `trade_goods_detail`;

CREATE TABLE `trade_goods_detail` (
  `id` varchar(225) NOT NULL COMMENT '交易id',
  `trade_name` varchar(225) DEFAULT NULL COMMENT '交易名称',
  `true_payment` varchar(225) DEFAULT NULL COMMENT '实付金额',
  `should_payment` varchar(225) DEFAULT NULL COMMENT '应付金额',
  `trade_time` varchar(225) DEFAULT NULL COMMENT '交易时间',
  `trade_card` varchar(225) DEFAULT NULL COMMENT '交易卡id',
  `status` int(11) DEFAULT NULL COMMENT '状态字',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `trade_goods_detail` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
